src/main/java/ok/dht/test/ushkov/report/stage3/profiles/2022-10-12-22-46-01_5nodes_put_t4_c64_R70000_d1m/wrk2.txt
Running 1m test @ http://localhost:1337
  4 threads and 64 connections
  Thread calibration: mean lat.: 5981.030ms, rate sampling interval: 15015ms
  Thread calibration: mean lat.: 5981.015ms, rate sampling interval: 15015ms
  Thread calibration: mean lat.: 5981.618ms, rate sampling interval: 15015ms
  Thread calibration: mean lat.: 5980.108ms, rate sampling interval: 15015ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.43s    12.00s   42.47s    48.97%
    Req/Sec     5.08k     1.70k    7.34k    33.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   23.81s 
 75.000%   37.68s 
 90.000%   40.53s 
 99.000%   42.24s 
 99.900%   42.43s 
 99.990%   42.47s 
 99.999%   42.50s 
100.000%   42.50s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7770.111     0.000000            4         1.00
    9838.591     0.100000       106539         1.11
   11968.511     0.200000       212905         1.25
   13910.015     0.300000       319156         1.43
   15867.903     0.400000       425419         1.67
   23805.951     0.500000       531967         2.00
   24788.991     0.550000       585292         2.22
   28819.455     0.600000       638335         2.50
   32767.999     0.650000       691438         2.86
   33718.271     0.700000       745097         3.33
   37683.199     0.750000       797477         4.00
   38174.719     0.775000       825027         4.44
   38633.471     0.800000       850613         5.00
   39092.223     0.825000       876749         5.71
   39583.743     0.850000       903943         6.67
   40042.495     0.875000       929994         8.00
   40271.871     0.887500       943240         8.89
   40534.015     0.900000       958273        10.00
   40763.391     0.912500       970724        11.43
   40992.767     0.925000       983640        13.33
   41222.143     0.937500       996429        16.00
   41353.215     0.943750      1004228        17.78
   41451.519     0.950000      1009792        20.00
   41582.591     0.956250      1016580        22.86
   41713.663     0.962500      1024125        26.67
   41844.735     0.968750      1030692        32.00
   41910.271     0.971875      1034382        35.56
   41943.039     0.975000      1036254        40.00
   42008.575     0.978125      1040166        45.71
   42074.111     0.981250      1044070        53.33
   42139.647     0.984375      1047887        64.00
   42139.647     0.985938      1047887        71.11
   42172.415     0.987500      1049802        80.00
   42205.183     0.989062      1051651        91.43
   42237.951     0.990625      1053545       106.67
   42270.719     0.992188      1055525       128.00
   42270.719     0.992969      1055525       142.22
   42303.487     0.993750      1057422       160.00
   42303.487     0.994531      1057422       182.86
   42336.255     0.995313      1059117       213.33
   42336.255     0.996094      1059117       256.00
   42336.255     0.996484      1059117       284.44
   42369.023     0.996875      1060551       320.00
   42369.023     0.997266      1060551       365.71
   42369.023     0.997656      1060551       426.67
   42401.791     0.998047      1061587       512.00
   42401.791     0.998242      1061587       568.89
   42401.791     0.998437      1061587       640.00
   42401.791     0.998633      1061587       731.43
   42401.791     0.998828      1061587       853.33
   42434.559     0.999023      1062261      1024.00
   42434.559     0.999121      1062261      1137.78
   42434.559     0.999219      1062261      1280.00
   42434.559     0.999316      1062261      1462.86
   42434.559     0.999414      1062261      1706.67
   42434.559     0.999512      1062261      2048.00
   42434.559     0.999561      1062261      2275.56
   42467.327     0.999609      1062597      2560.00
   42467.327     0.999658      1062597      2925.71
   42467.327     0.999707      1062597      3413.33
   42467.327     0.999756      1062597      4096.00
   42467.327     0.999780      1062597      4551.11
   42467.327     0.999805      1062597      5120.00
   42467.327     0.999829      1062597      5851.43
   42467.327     0.999854      1062597      6826.67
   42467.327     0.999878      1062597      8192.00
   42467.327     0.999890      1062597      9102.22
   42467.327     0.999902      1062597     10240.00
   42500.095     0.999915      1062692     11702.86
   42500.095     1.000000      1062692          inf
#[Mean    =    24426.847, StdDeviation   =    11997.690]
#[Max     =    42467.328, Total count    =      1062692]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1219184 requests in 1.00m, 77.90MB read
  Socket errors: connect 0, read 0, write 0, timeout 64
  Non-2xx or 3xx responses: 160
Requests/sec:  20291.24
Transfer/sec:      1.30MB